app/controllers/events_controller.rb

  def index
    if !(params[:id] == nil)
      @events = Event.find(:all, :conditions =>  ["org_id = ?", params[:id]], :order => "created_at")
    else
      #if logged_in?
      #  @owner = current_user.has_role? ('owner', event)
      #end
      @events = Event.all
---
SELECT * FROM `events` WHERE (org_id = '12') ORDER BY created_at
SELECT * FROM `events`

  def show
    @event = Event.find(params[:id])
    @comment = Comment.new
    @comments = Comment.find(:all, :conditions =>  ["event_id = ?", @event.id], :order => "created_at")
    @album = Album.find_by_id(@event.album_id)
---
SELECT * FROM `events` WHERE (`events`.`id` = 1)
SELECT * FROM `comments` WHERE (event_id = 1) ORDER BY created_at
SELECT * FROM `albums` WHERE (`albums`.`id` IS NULL) LIMIT 1

  def create
    @event = Event.new(params[:event])

    @album = Album.new
    @album.name = @event.name
    @album.save
---
INSERT INTO `albums` (`name`, `updated_at`, `description`, `created_at`) VALUES(NULL, '2009-11-29 04:50:00', NULL, '2009-11-29 04:50:00')
INSERT INTO `events` (`name`, `end_at`, `is_multi_day`, `updated_at`, `org_id`, `priority`, `album_id`, `location_id`, `start_at`, `is_active`, `description`, `category_id`, `created_at`) VALUES('hihi', '2009-11-27 19:09:00', 0, '2009-11-27 19:09:51', 1, 0, NULL, 1, '2009-11-27 19:09:00', 1, 'hi', 1, '2009-11-27 19:09:51')

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT * FROM `events` WHERE (`events`.`id` = 3)
UPDATE `events` SET `created_at` = '2009-12-09 23:27:06', `org_id` = 1, `album_id` = 4, `category_id` = 2, `location_id` = 1, `start_at` = '2009-12-09 23:26:00', `is_active` = 1, `priority` = 0, `description` = 'hihi', `end_at` = '2009-12-09 23:26:00', `is_multi_day` = 0, `updated_at` = '2009-12-09 23:36:44', `name` = 'testt' WHERE `id` = 3

  def cancel
    @event = Event.find(params[:id])
    @event.is_active = false
    respond_to do |format|
      if @event.save!
---
SELECT * FROM `events` WHERE (`events`.`id` = 2)
UPDATE `events` SET `created_at` = '2009-12-03 21:43:16', `org_id` = 1, `album_id` = 1, `category_id` = 2, `location_id` = 5, `start_at` = '2009-12-03 21:43:16', `is_active` = 0, `priority` = NULL, `description` = 'Our second annual Lewis and Clark BBQ is on its way. Come for food, horses, and historical attractions!', `end_at` = '2009-12-03 21:43:16', `is_multi_day` = NULL, `updated_at` = '2009-12-07 07:46:59', `name` = 'Lewis and Clark BBQ' WHERE `id` = 2

  def uncancel
    @event = Event.find(params[:id])
    @event.is_active = true
    respond_to do |format|
      if @event.save!
---
SELECT * FROM `events` WHERE (`events`.`id` = 2)
UPDATE `events` SET `created_at` = '2009-12-03 21:43:16', `org_id` = 1, `album_id` = 1, `category_id` = 2, `location_id` = 5, `start_at` = '2009-12-03 21:43:16', `is_active` = 1, `priority` = NULL, `description` = 'Our second annual Lewis and Clark BBQ is on its way. Come for food, horses, and historical attractions!', `end_at` = '2009-12-03 21:43:16', `is_multi_day` = NULL, `updated_at` = '2009-12-07 07:49:04', `name` = 'Lewis and Clark BBQ' WHERE `id` = 2

  def destroy
    @event = Event.find(params[:id])
---
SELECT * FROM `events` WHERE (`events`.`id` = 2)