app/controllers/locations_controller.rb

  def index
    @locations = Location.find(:all, :conditions =>  ["(org_id = ? OR org_id = ? ) AND is_active = ?", current_user.org_id,0, true])
---
SELECT * FROM `locations` WHERE ((org_id = 0 OR org_id = 0 ) AND is_active = 1)

  def show
    @location = Location.find(params[:id])
---
SELECT * FROM `locations` WHERE (`locations`.`id` = 0)

  def edit
    @location = Location.find(params[:id])
---
SELECT * FROM `locations` WHERE (`locations`.`id` = 6)

  def update
    @location = Location.find(params[:id])

    respond_to do |format|
      if @location.update_attributes(params[:location])
---
SELECT * FROM `locations` WHERE (`locations`.`id` = 10)
UPDATE `locations` SET `created_at` = '2009-11-23 05:44:02', `zip` = '14500', `org_id` = 1, `city` = 'Pittt', `is_active` = 1, `address2` = 'jaja', `x_co` = NULL, `y_co` = NULL, `address1` = 'jaja', `state` = 'PA', `pic_id` = 1, `updated_at` = '2009-11-23 05:45:38', `name` = 'Myine' WHERE `id` = 10