app/controllers/photos_controller.rb

  def show
    @photo = Photo.find(params[:id])
    @album = Album.find_by_id(@photo.album_id)
    @comment = Comment.new
    @comments = Comment.find(:all, :conditions =>  ["picture_id = ?", @photo.id], :order => "created_at")
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 32)
SELECT * FROM `albums` WHERE (`albums`.`id` = 1) LIMIT 1
SELECT * FROM `comments` WHERE (picture_id = 32) ORDER BY created_at